<?php


//Придумать две переменные, записать туда числа и вывести на экран их сумму,
//разницу, произведение, деление, возвести одно число в другое, показать остаток от деления (вставить php-файл)

$a = 4;
$b = 2;

echo "Сумма: " . ($a + $b) . "<br>";
echo "Разница: " . ($a - $b) . "<br>";
echo "Произведение: " . ($a * $b) . "<br>";
echo "Деление: " . ($a / $b) . "<br>";
echo "Степень: " . ($a ** $b) . "<br>";
echo "Остаток от деления: " . ($a % $b) . "<br>";



// Попробовать обернуть одно из значений переменных в кавычки (например, ‘2’ или ‘3’) и повторить
// все арифметические действия.

$a = '4';
$b = 2;

echo "Сумма: " . ($a + $b) . "<br>";
echo "Разница: " . ($a - $b) . "<br>";
echo "Произведение: " . ($a * $b) . "<br>";
echo "Деление: " . ($a / $b) . "<br>";
echo "Степень: " . ($a ** $b) . "<br>";
echo "Остаток от деления: " . ($a % $b) . "<br>";
